const firebaseAuthAR = {
  'user-not-found': 'المستخدم غير موجود.',
  'wrong-password': 'كلمة المرور غير صحيحة.',
  'invalid-password': 'كلمة المرور غير صحيحة.',
  'invalid-action-code': 'رمز غير صالح.',
  'user-disabled': 'تم تعطيل المستخدم.',
  'expired-action-code': 'انتهت صلاحية الرمز.',
  'weak-password': 'كلمة مرور ضعيفة.',
  'invalid-email': 'البريد الإلكتروني غير صالح.',
  'INVALID_LOGIN_CREDENTIALS': 'البريد الإلكتروني أو كلمة المرور غير صالحة.',
  'invalid-credential': 'البريد الإلكتروني أو كلمة المرور غير صالحة.',
  'email-already-in-use': 'البريد الإلكتروني مستخدم بالفعل.',
  'internal-error': 'واجه خادم المصادقة خطأ غير متوقع أثناء معالجة الطلب.',
  'too-many-requests':
      'تم تعطيل الوصول إلى هذا الحساب مؤقتًا بسبب العديد من محاولات تسجيل الدخول الفاشلة. يمكنك استعادته على الفور عن طريق إعادة تعيين كلمة المرور أو المحاولة مرة أخرى لاحقًا.',
  'unexpected-error': 'خطأ غير متوقع',
  "canceled": "تم إلغاء تسجيل الدخول",
};

const firestoreAR = {
  'aborted':
      'تم إلغاء العملية، عادةً بسبب مشكلة في التزامن مثل إلغاء المعاملات، وما إلى ذلك.',
  'already-exists': 'بعض الوثائق التي حاولنا إنشائها موجودة بالفعل.',
  'cancelled': 'تم إلغاء العملية (عادةً من قبل المستدعي).',
  'data-loss': 'فقدان بيانات لا يمكن استردادها أو تلف.',
  'deadline-exceeded': 'انتهت المهلة قبل أن تكتمل العملية.',
  'failed-precondition':
      'تم رفض العملية لأن النظام ليس في الحالة المطلوبة لتنفيذ العملية.',
  'internal': 'أخطاء داخلية.',
  'invalid-argument': 'لقد حددت حجة غير صالحة.',
  'not-found': 'لم يتم العثور على الوثيقة المطلوبة.',
  'out-of-range': 'تمت محاولة العملية خارج النطاق الصحيح.',
  'permission-denied': 'ليس لديك إذن لتنفيذ العملية المحددة.',
  'resource-exhausted':
      'تم استنفاد بعض الموارد، ربما حصة لكل مستخدم، أو ربما نفد نظام الملفات بالكامل من المساحة.',
  'unauthenticated': 'الطلب لا يحتوي على بيانات اعتماد مصادقة صالحة للعملية.',
  'unavailable': 'الخدمة غير متاحة حاليًا.',
  'unimplemented': 'العملية غير مُنفذة أو غير مدعومة/مفعلّة.',
  'server-file-wrong-size':
      'لا يتطابق حجم الملف على العميل مع حجم الملف الذي استلمه الخادم. يرجى إعادة التحميل.',
  'cannot-slice-blob':
      'بشكل عام، يحدث هذا عندما يتم تغيير الملف المحلي (حذفه، حفظه مرة أخرى، إلخ). حاول إعادة التحميل بعد التحقق من أن الملف لم يتغير.',
  'no-default-bucket': 'لم يتم تعيين أي دلو في خاصية storageBucket من التكوين.',
  'invalid-url':
      'تم تقديم عنوان URL غير صالح إلى refFromURL(). يجب أن يكون على شكل gs://bucket/object أو https://firebasestorage.googleapis.com/v0/b/bucket/o/object?token=<TOKEN>.',
  'invalid-event-name':
      'تم تقديم اسم حدث غير صالح. يجب أن يكون أحد: [running, progress, pause]',
  'canceled': 'ألغى المستخدم العملية.',
  'invalid-checksum':
      'لا يتطابق الملف على العميل مع_checksum_ للملف الذي استلمه الخادم. يرجى إعادة التحميل.',
  'retry-limit-exceeded':
      'تم تجاوز الحد الزمني للعملية (التحميل، التنزيل، الحذف، إلخ). يرجى المحاولة مرة أخرى.',
  'unauthorized':
      'المستخدم غير مصرح له بتنفيذ الإجراء المطلوب. تحقق من قواعد الأمان الخاصة بك.',
  'quota-exceeded':
      'تم تجاوز حصة الدلو لـ Cloud Storage. إذا كنت على المستوى المجاني، فقم بالترقية إلى خطة مدفوعة. إذا كنت بالفعل على خطة مدفوعة، يرجى الاتصال بدعم Firebase.',
  'unknown': 'خطأ غير معروف أو خطأ من مجال خطأ مختلف.',
  'object-not-found': 'لا يوجد كائن في المرجع المطلوب.',
  'bucket-not-found': 'لا يوجد دلو مُكون لـ Cloud Storage.',
  'project-not-found': 'لا يوجد مشروع مُكون لـ Cloud Storage.',
  'unexpected-error': 'خطأ غير متوقع'
};

Map<String, String> exceptionAR(String complement) => {
      "already_scheduled":
          "تم حجز هذا الوقت بالفعل! قم بإلغاء الموعد أولاً للمتابعة مع الحذف.",
      "time_already_exists":
          "يجب أن يكون الوقت المحدد موجودًا بالفعل $complement",
      "try_login_with_site_user":
          "حاول تسجيل الدخول أولاً باستخدام حساب الموقع",
      "unexpected_error": "خطأ غير متوقع",
      "user_not_found_in_app": "المستخدم في التطبيق غير موجود.",
      "user_not_found": "المستخدم غير موجود.",
      "already_purchased": "تم شراء المنتج بالفعل.",
      "number_invalid": "تنسيق رقمي غير صالح!",
      "userWeb": "خطأ: userweb",
      "noFaceInDocument": "لا يوجد وجه تم اكتشافه في صورة الوثيقة.",
      "noTextInDocument": "لا يوجد نص في صورة الوثيقة.",
      "noUsernameFoundInDocument":
          "لم يتم العثور على اسم المستخدم في صورة الوثيقة.",
      "noFaceInSelfie": "لا يوجد وجه تم اكتشافه في صورة السيلفي.",
      "failedToDetectFace": "فشل في اكتشاف الوجه في السيلفي.",
      "FailedToDetectDocument":
          "فشل في استخراج النص أو اكتشاف الوجه من الوثيقة.",
      "wrong_user":
          "خطأ: الحساب المحدد يختلف عن الحساب الذي تم تسجيل الدخول به. حاول مرة أخرى",
      "select_profession": "يرجى اختيار مهنة",
      "select_specialty": "يرجى اختيار تخصص",
    };
