const firebaseAuthBN = {
  'user-not-found': 'ব্যবহারকারী পাওয়া যায়নি।',
  'wrong-password': 'অবৈধ পাসওয়ার্ড।',
  'invalid-password': 'অবৈধ পাসওয়ার্ড।',
  'invalid-action-code': 'অবৈধ কোড।',
  'user-disabled': 'ব্যবহারকারী নিষ্ক্রিয়।',
  'expired-action-code': 'কোডের মেয়াদ শেষ হয়েছে।',
  'weak-password': 'পাসওয়ার্ড খুব দুর্বল।',
  'invalid-email': 'অবৈধ ইমেল।',
  'INVALID_LOGIN_CREDENTIALS': 'ইমেল বা পাসওয়ার্ড অবৈধ।',
  'invalid-credential': 'ইমেল বা পাসওয়ার্ড অবৈধ।',
  'email-already-in-use': 'ইমেলটি ইতিমধ্যে ব্যবহৃত হচ্ছে।',
  'internal-error':
      'প্রমাণীকরণ সার্ভার অনাকাঙ্ক্ষিত ত্রুটির সম্মুখীন হয়েছে অনুরোধটি প্রক্রিয়া করতে গিয়ে।',
  'too-many-requests':
      'এই অ্যাকাউন্টে অতিরিক্ত ভুল লগইন প্রচেষ্টার কারণে সাময়িকভাবে অ্যাক্সেস বন্ধ করা হয়েছে। আপনি আপনার পাসওয়ার্ড রিসেট করে তাৎক্ষণিকভাবে পুনরুদ্ধার করতে পারেন অথবা পরে আবার চেষ্টা করুন।',
  'unexpected-error': 'অপ্রত্যাশিত ত্রুটি',
  "canceled": "লগইন বাতিল করা হয়েছে",
};

const firestoreBN = {
  'aborted': 'অপারেশন বাতিল হয়েছে, সাধারণত একাধিক অনুরোধের দ্বন্দ্বের কারণে।',
  'already-exists':
      'যে ডকুমেন্টটি তৈরি করার চেষ্টা করা হয়েছে, তা ইতিমধ্যে বিদ্যমান।',
  'cancelled': 'অপারেশন বাতিল হয়েছে (সাধারণত কলকারী দ্বারা)।',
  'data-loss': 'ডেটা হারানো বা অপরিবর্তনীয়ভাবে নষ্ট হওয়া।',
  'deadline-exceeded': 'অপারেশন শেষ হওয়ার আগেই সময়সীমা অতিক্রম করেছে।',
  'failed-precondition':
      'সিস্টেমের অবস্থা উপযুক্ত না হওয়ায় অপারেশন বাতিল হয়েছে।',
  'internal': 'অভ্যন্তরীণ ত্রুটি।',
  'invalid-argument': 'অবৈধ আর্গুমেন্ট নির্দিষ্ট করা হয়েছে।',
  'not-found': 'অনুরোধকৃত ডকুমেন্ট পাওয়া যায়নি।',
  'out-of-range': 'বৈধ সীমার বাইরে অপারেশন করা হয়েছে।',
  'permission-denied': 'আপনার অনুরোধকৃত অপারেশন করার অনুমতি নেই।',
  'resource-exhausted':
      'কোনো রিসোর্স শেষ হয়ে গেছে, যেমন ব্যবহারকারীর কোটার সীমা বা ডিস্ক স্পেস।',
  'unauthenticated': 'এই অনুরোধের জন্য বৈধ প্রমাণীকরণ নেই।',
  'unavailable': 'পরিষেবাটি বর্তমানে উপলব্ধ নয়।',
  'unimplemented': 'এই অপারেশনটি বাস্তবায়িত নয় বা সমর্থিত নয়।',
  'server-file-wrong-size':
      'ক্লায়েন্টে ফাইলের আকার সার্ভারের সঙ্গে মেলে না। আবার আপলোড করুন।',
  'cannot-slice-blob':
      'সাধারণত স্থানীয় ফাইল পরিবর্তন হলে এটি ঘটে। দয়া করে যাচাই করে আবার আপলোড করুন।',
  'no-default-bucket':
      'storageBucket কনফিগারেশনে কোনো ডিফল্ট bucket নির্ধারিত নেই।',
  'invalid-url':
      'refFromURL() এর জন্য প্রদত্ত URL অবৈধ। সঠিক ফর্ম্যাট হতে হবে: gs://bucket/object অথবা https://firebasestorage.googleapis.com/v0/b/bucket/o/object?token=<TOKEN>',
  'invalid-event-name':
      'অবৈধ ইভেন্ট নাম। অনুমোদিত মান: [running, progress, pause]',
  'canceled': 'ব্যবহারকারী অপারেশনটি বাতিল করেছেন।',
  'invalid-checksum': 'ফাইলের চেকসাম সার্ভারের সঙ্গে মেলে না। আবার আপলোড করুন।',
  'retry-limit-exceeded': 'অপারেশনের সময়সীমা অতিক্রম করেছে। আবার চেষ্টা করুন।',
  'unauthorized':
      'এই অ্যাকশনটি সম্পাদনের জন্য ব্যবহারকারীর অনুমতি নেই। সিকিউরিটি রুলস যাচাই করুন।',
  'quota-exceeded':
      'Cloud Storage কোটার সীমা অতিক্রম করা হয়েছে। বিনামূল্যের স্তরে থাকলে, একটি পেইড প্ল্যানে আপগ্রেড করুন বা Firebase সাপোর্টে যোগাযোগ করুন।',
  'unknown': 'অজানা ত্রুটি বা ভিন্ন উৎস থেকে ত্রুটি।',
  'object-not-found': 'প্রত্যাশিত রেফারেন্সে কোনো অবজেক্ট পাওয়া যায়নি।',
  'bucket-not-found': 'Cloud Storage এর জন্য কোনো bucket কনফিগার করা হয়নি।',
  'project-not-found': 'Cloud Storage এর জন্য কোনো প্রকল্প কনফিগার করা হয়নি।',
  'unexpected-error': 'অপ্রত্যাশিত ত্রুটি'
};

Map<String, String> exceptionBN(String complement) => {
      "already_scheduled":
          "এই সময়টি ইতিমধ্যে নির্ধারিত হয়েছে! বাতিল না করে মুছে ফেলা যাবে না।",
      "time_already_exists": "এই সময়টি ইতিমধ্যে বিদ্যমান $complement",
      "try_login_with_site_user":
          "প্রথমে সাইট অ্যাকাউন্ট দিয়ে লগইন করার চেষ্টা করুন।",
      "unexpected_error": "অপ্রত্যাশিত ত্রুটি",
      "user_not_found_in_app": "অ্যাপ্লিকেশনে ব্যবহারকারী পাওয়া যায়নি।",
      "user_not_found": "ব্যবহারকারী পাওয়া যায়নি।",
      "already_purchased": "পণ্যটি ইতিমধ্যে কেনা হয়েছে।",
      "number_invalid": "অবৈধ নম্বর ফরম্যাট!",
      "userWeb": "ত্রুটি: userweb",
      "noFaceInDocument": "নথির ছবিতে কোনো মুখ সনাক্ত করা যায়নি।",
      "noTextInDocument": "নথির ছবিতে কোনো লেখা নেই।",
      "noUsernameFoundInDocument":
          "নথির ছবিতে কোনো ব্যবহারকারীর নাম পাওয়া যায়নি।",
      "noFaceInSelfie": "সেলফি ছবিতে কোনো মুখ সনাক্ত করা যায়নি।",
      "failedToDetectFace": "সেলফিতে মুখ সনাক্ত করতে ব্যর্থ।",
      "failedToDetectDocument": "নথিতে মুখ বা লেখা সনাক্ত করতে ব্যর্থ।",
      "wrong_user":
          "ত্রুটি: নির্বাচিত অ্যাকাউন্টটি বর্তমানে লগইন করা অ্যাকাউন্ট থেকে আলাদা। আবার চেষ্টা করুন",
      "select_profession": "অনুগ্রহ করে একটি পেশা নির্বাচন করুন",
      "select_specialty": "অনুগ্রহ করে একটি বিশেষত্ব নির্বাচন করুন",
    };
