const firebaseAuthHI = {
  'user-not-found': 'उपयोगकर्ता नहीं मिला।',
  'wrong-password': 'अमान्य पासवर्ड।',
  'invalid-password': 'अमान्य पासवर्ड।',
  'invalid-action-code': 'अमान्य कोड।',
  'user-disabled': 'उपयोगकर्ता अक्षम है।',
  'expired-action-code': 'कोड की समय सीमा समाप्त हो गई है।',
  'weak-password': 'पासवर्ड बहुत कमजोर है।',
  'invalid-email': 'अमान्य ईमेल।',
  'INVALID_LOGIN_CREDENTIALS': 'अमान्य ईमेल या पासवर्ड।',
  'invalid-credential': 'अमान्य ईमेल या पासवर्ड।',
  'email-already-in-use': 'ईमेल पहले से उपयोग में है।',
  'internal-error':
      'प्रमाणीकरण सर्वर ने अनुरोध को संसाधित करते समय अप्रत्याशित त्रुटि पाई।',
  'too-many-requests':
      'इस खाते तक पहुंच बहुत अधिक असफल लॉगिन प्रयासों के कारण अस्थायी रूप से निष्क्रिय कर दी गई है। आप तुरंत अपना पासवर्ड रीसेट करके इसे पुनर्स्थापित कर सकते हैं या बाद में पुनः प्रयास कर सकते हैं।',
  'unexpected-error': 'अप्रत्याशित त्रुटि।',
  "canceled": "लॉगिन रद्द कर दिया गया",
};

const firestoreHI = {
  'aborted':
      'ऑपरेशन को रद्द कर दिया गया, आमतौर पर प्रतिस्पर्धा की समस्या के कारण।',
  'already-exists':
      'जिस दस्तावेज़ को बनाने का प्रयास किया गया वह पहले से मौजूद है।',
  'cancelled': 'ऑपरेशन रद्द कर दिया गया (आमतौर पर कॉलर द्वारा)।',
  'data-loss': 'डेटा की हानि या अपूरणीय क्षति।',
  'deadline-exceeded': 'ऑपरेशन पूरा होने से पहले समय सीमा समाप्त हो गई।',
  'failed-precondition':
      'सिस्टम आवश्यक स्थिति में नहीं है, इसलिए ऑपरेशन को अस्वीकार कर दिया गया।',
  'internal': 'आंतरिक त्रुटियां।',
  'invalid-argument': 'आपने अमान्य तर्क निर्दिष्ट किया है।',
  'not-found': 'कुछ अनुरोधित दस्तावेज़ नहीं मिले।',
  'out-of-range': 'ऑपरेशन को मान्य सीमा से बाहर आज़माया गया।',
  'permission-denied':
      'आपके पास निर्दिष्ट ऑपरेशन को निष्पादित करने की अनुमति नहीं है।',
  'resource-exhausted':
      'कुछ संसाधन समाप्त हो गए, संभवतः उपयोगकर्ता कोटा या पूरी फाइल सिस्टम।',
  'unauthenticated': 'ऑपरेशन के लिए मान्य प्रमाणीकरण क्रेडेंशियल्स नहीं हैं।',
  'unavailable': 'सेवा इस समय उपलब्ध नहीं है।',
  'unimplemented': 'ऑपरेशन को लागू नहीं किया गया है या समर्थित/सक्रिय नहीं है।',
  'server-file-wrong-size':
      'क्लाइंट पर फ़ाइल का आकार सर्वर द्वारा प्राप्त फ़ाइल के आकार से मेल नहीं खाता। फिर से अपलोड करें।',
  'cannot-slice-blob':
      'आमतौर पर यह तब होता है जब स्थानीय फ़ाइल को बदला गया हो (हटा दिया गया, पुनः सहेजा गया आदि)। जांच करें कि फ़ाइल बदली नहीं गई है और पुनः प्रयास करें।',
  'no-default-bucket':
      'स्टोरेज बकेट सेटिंग्स में कोई बकेट परिभाषित नहीं किया गया है।',
  'invalid-url':
      'refFromURL() के लिए दिया गया URL अमान्य है। इसे gs://bucket/object या https://firebasestorage.googleapis.com/v0/b/bucket/o/object?token=<TOKEN> के प्रारूप में होना चाहिए।',
  'invalid-event-name':
      'अमान्य ईवेंट नाम दिया गया है। इसे इनमें से एक होना चाहिए: [running, progress, pause]।',
  'canceled': 'उपयोगकर्ता ने ऑपरेशन रद्द कर दिया।',
  'invalid-checksum':
      'क्लाइंट पर फ़ाइल का चेकसम सर्वर की फ़ाइल से मेल नहीं खाता। कृपया पुनः अपलोड करें।',
  'retry-limit-exceeded':
      'ऑपरेशन (अपलोड, डाउनलोड, डिलीट आदि) के लिए समय सीमा समाप्त हो गई। पुनः प्रयास करें।',
  'unauthorized':
      'उपयोगकर्ता को वांछित कार्रवाई करने की अनुमति नहीं है। सुनिश्चित करें कि सुरक्षा नियम सही हैं।',
  'quota-exceeded':
      'क्लाउड स्टोरेज बकेट की कोटा सीमा समाप्त हो गई है। यदि आप निःशुल्क योजना पर हैं, तो भुगतान योजना में अपग्रेड करें। यदि आप पहले से भुगतान योजना पर हैं, तो Firebase समर्थन से संपर्क करें।',
  'unknown': 'अज्ञात त्रुटि या एक अलग डोमेन से त्रुटि।',
  'object-not-found': 'निर्दिष्ट संदर्भ पर कोई ऑब्जेक्ट नहीं मिला।',
  'bucket-not-found': 'क्लाउड स्टोरेज के लिए कोई बकेट सेट नहीं है।',
  'project-not-found': 'क्लाउड स्टोरेज के लिए कोई प्रोजेक्ट सेट नहीं है।',
  'unexpected-error': 'अप्रत्याशित त्रुटि।'
};

Map<String, String> exceptionHI(String complement) => {
      "already_scheduled":
          "यह समय पहले से ही निर्धारित है! हटाने के लिए पहले शेड्यूल को रद्द करें।",
      "time_already_exists": "समय पहले से मौजूद है $complement",
      "try_login_with_site_user":
          "पहले साइट खाते से लॉगिन करने का प्रयास करें।",
      "unexpected_error": "अप्रत्याशित त्रुटि।",
      "user_not_found_in_app": "ऐप उपयोगकर्ता नहीं मिला।",
      "user_not_found": "उपयोगकर्ता नहीं मिला।",
      "already_purchased": "उत्पाद पहले से खरीदा गया है।",
      "number_invalid": "अमान्य संख्यात्मक प्रारूप!",
      "userWeb": "त्रुटि: userweb",
      "noFaceInDocument": "दस्तावेज़ छवि में कोई चेहरा नहीं मिला।",
      "noTextInDocument": "दस्तावेज़ छवि में कोई पाठ नहीं मिला।",
      "noUsernameFoundInDocument":
          "दस्तावेज़ छवि में उपयोगकर्ता नाम नहीं मिला।",
      "noFaceInSelfie": "सेल्फी छवि में कोई चेहरा नहीं मिला।",
      "failedToDetectFace": "सेल्फी में चेहरा पहचानने में विफल।",
      "failedToDetectDocument":
          "दस्तावेज़ से पाठ निकालने या चेहरा पहचानने में विफल।",
      "wrong_user":
          "त्रुटि: चयनित खाता लॉगिन किए गए खाते से अलग है। कृपया पुनः प्रयास करें",
      "select_profession": "कृपया एक पेशा चुनें",
      "select_specialty": "कृपया एक विशेषज्ञता चुनें",
    };
